import React, { useState } from 'react'
import BeeWithKutubee from '../../../components/Bees/BeeWithKutubee'
import { useTranslation } from 'react-i18next';

const Privacy = () => {
    const { t, i18n } = useTranslation([], { useSuspense: false });

    return (
        <div>
            <div className="section-title">{t('settings.privacyPolicy')}</div>
            <BeeWithKutubee height={133.09} width={125} />
            <div style={{ marginTop: '30px',direction:"rtl" }} className="settingsNormalText">
                أهلا بك في سياسة خصوصية تطبيق كتبي للقراءة التفاعلية (“يشار اليه فيما بعد بـ التطبيق”). يتم تشغيل وادارة هذا التطبيق من قبل الشركة المالكة له “جبل عمان ناشرون” و/أو الشركات التابعة له.
                <div className="settingsNormalText">
                    مقدمة
                </div>
                <div className="settingsNormalText">
                    ان سياسة الخصوصية هذه تعلمك بسياستنا فيما يتعلق بجمع واستعمال وافشاء المعلومات الشخصية أثناء استعمالك للتطبيق بالاضافة للخيارات المتاحة لديك والمتعلقة بهذه المعلومات بموجب سياسة الخصوصية هذه حيث ان أولى اهتمامتنا هو حفاظ وضمان خصوصية استعمالك للتطبيق وخصوصية المعلومات المقدمة من قبلك على التطبيق.
                    نحن نقوم باستعمال معلوماتك الشخصية – كما هي معرفة أدناه – لتقديم الخدمات المتاحة في التطبيق وتحسينها و/او تحسين استعمالك للتطبيق. بمجرد استعمالك التطبيق، أنت توافق على جمعنا للمعلومات واستعمالها وفقا لهذه السياسة.
                </div>
                <div className="settingsNormalText">
                    تعريفات
                </div>
                <div className="settingsNormalText">


                    لغايات هذه السياسة، يكون للمصطلحات التالية المعاني المحددة لها كما يلي:

                    معلوماتك الشخصية تعني معلومات مستخدم التطبيق سواء كانت هذه المعلمات بحوزتنا او من المحتمل ان تصبح بحوزتنا بما في ذلك على سبيل المثال لا الحصر بيانات الاستعمال.

                    بيانات الاستعمال تعني البيانات المجمعة بشكل تلقائي سواء كانت ناتجة عن استعمال التطبيق و/او ناتجة عن بنية التطبيق ذاتها (على سبيل المثال مدة زيارة التطبيق).

                    الكوكيز هي ملفات صغيرة يتم حفظها على جهازك سواء كان جهاز حاسوب او هاتف نقال.

                    مراقب المعلومات يعني نحن أو أي شخص طبيعي او معنوي الذي يقرر (لوحده او مع الغير) الغاية من معالجة المعلومات الشخصية او الطريقة التي تعالج بها او التي سيتم معالجتها بها.

                    معالجي المعلومات (او مقدمي الخدمات) تعني اي شخص طبيعي او معنوي يعالج المعلومات بالنيابة عن مراقب المعلومات. من الممكن الاستعانة بخدمات اطراف ثالثة (بما في ذلك على سبيل المثال لا الحصر اطراف ثالثة يتم اختيارهم من قبلنا) من اجل معالجة معلوماتك بطريقة اكثر كفاءة.

                    المستخدم هو اي شخص طبيعي يقوم باستخدام الخدمات وأ/او التطبيق وذات صلة بالمعلومات الشخصية.


                </div>
                <div className="settingsNormalText">
                    تجميع المعلومات واستعمالها

                </div>
                <div className="settingsNormalText">


                    نحن نقوم بتجميع عدد كبير من معلومات متنوعة لغايات مختلفة وذلك لتقديم الخدمات المتاحة لك على التطبيق وتحسينهم وتشمل على سبيل المثال لا الحصر:

                </div>
                <div className="settingsNormalText">

                    <ul className="settingsNormalText">
                        <li style={{ textAlign: 'right' }} >البريد الالكتروني</li>
                        <li>الاسم الاول والاسم الاخير</li>
                        <li >رقم الهاتف</li>
                        <li >العنوان، المنطقة، المحافظة، الرمز البريدي، المدينة</li>
                        <li >الكوكيز وبيانات الاستعمال</li>
                    </ul>
                </div>


                <div className="settingsNormalText">

                    نحن نستخدم معلوماتك الشخصية لادارة حساباتك والتواصل معك بخصوص العروض والمستجدات على طلباتك ولايصالك بالخدمات والمواد الاعلانية والترويجية ومعلومات اخرى ايا كان نوعها التي قد تكون من ضمن اهتماماتك سواء تم تطويرها من قبلنا لوحدنا او من قبل اطراف ثالثة او بالتعاون فينا بيننا وبين اي طرف ثالث.</div>

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                بيانات الاستعمال

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                قد نعمل على تجميع معلومات بيانات الاستعمال التي يقوم المتصفح الخاص بك بارسالها عندما تقوم باستخدام الموقع او دخولك له من خلال او بواسطة جهاز هاتف نقال (بيانات الاستعمال).

                هذه قد تتضمن معلومات مثل معلومات عنوان الانترنت البروتوكول للجهاز ونوع المتصفح واصدار المتصفح وصفحات المواقع التي تقوم بزيارتها ووقت وتاريخ زيارتك والوقت الذي استغرقته على هذه الصفحات ومعرفات الجهاز النادرة وغيرها من البيانات التشخيصية.

                عندما تقوم بالدخول للتطبيق من خلال جهاز هاتف محمول، بيانات الاستعمال هذه قد تتضمن معلومات مثل نوع جهاز الهاتف المحمول الذي تستعمله ومعرف الهاتف الفريد الخاص بهاتفك المحمول وعنوان الانترنت والبروتوكول الخاص بهاتفك المحمول ونوع متصفح الانترنت عبر الهاتف المحمول المستعمل من قبلك ومعرفات الجهاز النادرة وغيرها من البيانات التشخيصية.


            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                استعمال البيانات

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>



                نحن نقوم باستعمال البيانات المجمعة لغايات متنوعة، تشمل على سبيل المثال وليس الحصر:

                لغايات تقديم خدماتنا.
                لغايات اشعارك عن اي تغييرات بخدماتنا.
                لتمكينك بناء على اختيارك من المشاركة في الخاصيات التفاعلية لخدمتنا.
                لتقديم خدمة دعم العملاء.
                لتجميع تحليلات او معلومات قيمة تمكننا من تطوير خدماتنا و/او التطبيق.
                لمراقبة استعمال خدماتنا و/او التطبيق.
                لكشف ومعالجة المشاكل التقنية والحد منها.
                لتزويدك بالاخبار والعروض الخاصة ومعلومات عامة عن بضائع وخدمات ومناسبات اخرى التي نقدمها والتي تتشابه مع البضائع والخدمات التي قمت بشرائها او الاستفسار عنها الا اذا قمت بالانسحاب من تلقي مثل هذه المعلومات.

                التسويق المباشر من قبل تطبيق كتبي أو طرف ثالث بواسطة تطبيق كتبي.


            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                الاسس القانونية لمعالجة البيانات وفقا لاحكام النظام العام لحماية البيانات (GDPR)

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                اذا كنت من المنطقة الاقتصادية الاوروبية، فان الاسس القانونية المتبعة من قبل التطبيق في جمع المعلومات الشخصية واستعمالها كما هي موصوفة في سياسة الخصوصية تعتمد على المعلومات الشخصية التي نقوم بجمعها والسياق المحدد الذي تم جمعها به.

                قد نقوم بمعالجة معلوماتك الشخصية لاي من تلك الاسباب:

                حاجتنا للتعاقد معك.
                قد قمت بالسماح لنا بالقيام بذلك.
                اذا كانت المعالجة لمصلحتنا المشروعة ولا تتجاوز حقوقك.
                لغايات عمليات الدفع.
                للالتزام باحكام القانون.
                الرجاء الاتصال بنا اذا كنت ترغب بمعرفة اي معلومات شخصية عنك نحتفظ بها واذا كنت ترغب بان تحذف هذه المعلومات من انظمتنا. يكون لديك حقوق حماية البيانات التالية:

                الحق بالدخول أو تحديث او حذف المعلومات التي نملكها عنك. باي وقت ممكن، لديك الحق بالدخول أو تحديث او طلب حذف معلوماتك الشخصية وبشكل مباشر عن طريق قسم اعدادات حسابك. الرجاء الاتصال بنا لمساعدتك بحال عدم تمكنك من ممارسة هذه الافعال.

                الحق بالتصحيح: لديك الحق بتصحيح معلوماتك بحال ان كانت هذه المعلومات غير دقيقة او ناقصة.

                الحق بالاعتراض: لديك الحق بالاعتراض على قيامنا بمعالجة معلوماتك الشخصية.

                الحق بالتقييد: لديك الحق بان تقدم لنا طلب بتقييد معالجة معلوماتك الشخصية.

                الحق بنقل البيانات: لديك الحق بان يتم تزويدك بنسخة عن المعلومات التي بحوزتنا عنك وذلك بشكل منظم، مقروء اليا ومستعمل بشكل متعارف عليه.

                الحق بسحب الموافقة: لديك ايضا الحق باي وقت بسحب موافقتك التي اعتمدنا عليها وبناء عليها قمنا بمعالجة معلوماتك الشخصية.

                قد نطلب منك تثبيت هويتك قبل الرد على اي من هذه الطلبات.

                لديك الحق بان تشكو لسلطة حماية البيانات عن قيامنا بتجميع معلوماتك الشخصية واستعمالنا لها. لمزيد من المعلومات، الرجاء الاتصال بسلطة حماية البيانات المحلية لديك في المنطقة الاقتصادية الاوروبية.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                الاحتفاظ بالمعلومات

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                سنحتفظ بمعلوماتك الشخصية فقط خلال الوقت الذي يكون به هذا الامر ضروري للغايات المحددة في سياسة الخصوصية. سنحتفظ بمعلوماتك الشخصية ونستعملها فقط للحد الضروري لتوافقنا مع التزاماتنا القانونية (على سبيل المثال، اذا كان من المطلوب منا ان نعمل على الاحتفاظ ببياناتك التزاما بالقوانين المطبقة) ولحل النزاعات ولتطبيق اتفاقياتنا القانونية وسياساتنا.

                سنعمل ايضا على الاحتفاظ ببيانات الاستعمال للغايات التحليلية الداخلية. بشكل عام، بيانات الاستعمال يتم الاحتفاظ بها لوقت اقصر، فيما عدا الحالات التي تكون فيها البيانات مستعملة لتقوية الامن وتطوير وظائف خدماتنا و/او التطبيق او الحالات التي نكون فيها ملزمين قانونيا بالاحتفاظ بهذه البيانات لوقت اطول.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                تحويل البيانات

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                من الممكن تحويل وحفظ معلوماتك بما في ذلك المعلومات الشخصية، على اجهزة حاسوب او اجهزة متواجدة خارج اختصاصك الجغرافي او اي اختصاص حكومي اخر يكون فيها قوانين حماية البيانات تختلف عن تلك الخاصة بمنطقتك واختصاصك.

                ان موافقتك على سياسة الخصوصية هذه وقيامك تبعا لذلك بتقديم المعلومات يمثل موافقتك على تحويل بياناتك لاي دولة اخرى يتواجد فيها اي من شركاتنا التابعة و/او الحليفة.

                نحن نقوم باتخاذ كافة الاجراءات الضرورية بشكل معقول للتاكيد على انه يتم التعامل مع بياناتك بطريقة امنة وبما يتوافق مع سياسة الخصوصية هذه وانه لن يتم تحويل بياناتك الشخصية لاي منظمة او دولة الا بحالة توافر ضوابط كافية بما في ذلك امن بياناتك والمعلومات الشخصية الاخرى.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                الافشاء تطبيقا لأحكام القانون

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                في ظروف معينة، قد يكون من المطلوب منا ان نقوم بالافشاء عن معلوماتك الشخصية بحال تطلب ذلك القانون او للاجابة على طلبات السلطات الحكومية النافذة (على سبيل المثال المحكمة او جهة حكومية).

                قد نقوم بالافشاء عن معلوماتك الشخصية بحسن نية اذا كان هذا الفعل ضروري لـ:

                تطبيق الالتزامات القانونية.
                لحماية حقوق تطبيق كتبي للقراءة التفاعلية و/أو اي من شركاتها التابعة و/او الحليفة او اي من ممتلكاتها والدفاع عنها.
                للحد من اي فعل خاطئ متعلق بالتطبيق.
                لحماية الامن الشخصي لمستخدمين التطبيق و/او العامة.
                للحماية في مواجهة المسؤولية القانونية.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                أمن البيانات

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                ان امن بياناتك مهم لدينا ولكن لا بد من التذكر بان وسائل النقل عبر الانترنت ووسائل التخزين الالكتروني ليست 100% امنة. في الوقت الذي نسعى به لاستعمال الوسائل التجارية المقبولة لحماية معلوماتك الشخصية الا اننا لا نضمن انها امنة بشكل مطلق حيث ان بعض الاحداث قد تقع خارج سيطرتنا ولا تكون متعلقة بسلوك متعمد و/او الاهمال المتعمد من قبلنا.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                مقدموا الخدمة

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>



                من الممكن ان نقوم بالاستعانة بخدمات اطراف ثالثة سواء شركات وافراد لغاية تسهيل خدماتنا (“مقدمي الخدمات”) و/او لتقديم الخدمات بالنيابة عنا و/او تقديم خدمات ذات علاقة بخدماتنا و/او مساعدتنا في تحليل الكيفية التي تستخدم فيها خدماتنا.

                سيكون لمقدمي الخدمة من الاطراف الثالثة الحق بالاطلاع على معلوماتك الشخصية فقط لغايات القيام بمهامهم نيابة عنا وسيكونوا ملتزمين بعد افشائها او استخدامها لاي غايات اخرى.
                الاعلانات

                قد نعمل على استعمال اطراف ثالثة من مقدمي الخدمات لعرض الاعلانات لك للمساعدة على دعم الخدمات و/او التطبيق والمحافظة عليهم. تشمل الاطراف الثالثة على سبيل المثال وليس الحصر Google AdSense DoubleClick Cookie و.AdMob by Google

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                تجديد النشاط التسويقي السلوكي

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>



                نحن نقوم باستعمال خدمات تجديد النشاط التسويقي للاعلان عبر المواقع الالكترونية للاطراف الثالثة بعد قيامك بزيارة التطبيق. نحن والطرف الثالث نستعمل الكوكيز لاعلام وتحسين وتقديم الاعلانات وفقا للزيارات السابقة لديك لتطبيقنا. تشمل الاطراف الثالثة على سبيل المثال وليس الحصر اعلانات جوجل وتويتر وفيسبوك.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                الدفع
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>



                نحن نقوم باستعمال خدمات اطراف ثالثة لعمليات الدفع (مثل معالجي الدفع).

                لن نقوم بتخزين او جمع معلومات بطاقة الدفع الخاصة بك. يتم تزويد هذه المعلومات للطرف الثالث بها مباشرة بحيث يكون استعمالهم لمعلوماتك الشخصية معالج بسياسة الخصوصية الخاصة بهم.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                الروابط لمواقع اخرى
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>
                قد يحتوي التطبيق على روابط لمواقع اخرى التي لا يتم تشغيلها من قبلنا. نحن ننصحك بان تعمل على مراجعة سياسية الخصوصية لكل الموقع أو تطبيق الكتروني تزوره.

                نحن لا نملك السيطرة ولا نتحمل المسؤولية على المحتوى، سياسيات الخصوصية او الممارسات لمواقع الاطراف الثالثة وخدماتهم.

            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                التعديل على سياسة الخصوصية
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                قد نعمل على تحديث و/او تعديل سياسة الخصوصية هذه من وقت لاخر دون اشعار. ننصحك بان تعمل على قراءة ومراجعة سياسة الخصوصية هذه بشكل دوري. ان اي تغييرات على سياسة الخصوصية هذه يكون معمول بها من من تاريخ نشرها على التطبيق.
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                للاتصال بنا
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                بحال وجود اي استفسار لديك يتعلق بسياسة الخصوصية هذه أو في حال رغبتك بتعديل معلوماتك الشخصية أو وقف استلام الرسائل الدعائية، الرجاء الاتصال بنا عن طريق البريد الالكتروني: info@kutubee.com
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>

                إلغاء الاشتراك
            </div>
            <div className="settingsNormalText" style={{direction:"rtl"}}>


                تستطيع عندما تريد سحب موافقتك على استلام مخاطبات دورية بخصوص المواصفات، والمنتجات، والخدمات، والفعاليات وذلك عن طريق الرد على وصلة "إلغاء الاشتراك" في المخاطبات القادمة منا.

                الرجاء ملاحظة أننا لن نقوم بالإفصاح عن معلومات المستخدم الخاصة بك لطرف ثالث لتمكينه من إرسال مخاطبات تسويق مباشرة لك دون موافقتك المسبقة على القيام بذلك.
            </div>

        </div >

    )
}

Privacy.layout = "In";

export default Privacy;