import React, { useState } from 'react'
import BeeWithKutubee from '../../../components/Bees/BeeWithKutubee'
import { useTranslation } from 'react-i18next';

const Terms = () => {
    const { t, i18n } = useTranslation([], { useSuspense: false });

    return (
        <div>
            <div className="section-title">{t('settings.terms')}</div>
            <BeeWithKutubee height={133.09} width={125} />
            <div style={{ marginTop: '30px' }} className="settingsNormalText">يرجى قراءة هذه الشروط بعناية فائقة، حيث إن النقر على “أوافق” يعني أنك تقر وتوافق على جميع هذه الشروط، وتلتزم بها، ويؤكد أنك قرأتها وفهمتها. وفي حال عدم الموافقة على هذه الشروط، فإنك لن تكون قادرًا على استخدام التطبيق.
            </div>
            <div className="settingsNormalText">
                كما يفضل الاحتفاظ بنسخة من هذه الشروط للرجوع إليها في المستقبل.
            </div>
            <div className="settingsNormalText">

                <ol>
                    <li style={{ textAlign: 'right' }}>تعود ملكية التطبيق إلى شركة جبل عمان ناشرون، ويدار من قبلها، والمشار إليها بــ (&ldquo;الشركة المالكة&rdquo;) وعنوانها بناية رقم (81) الدوار الثالث، جبل عمَّان، عمَّان- الأردن.</li>
                    <li style={{ textAlign: 'right' }}>                 بدفع مبلغ الاشتراك يكون لك الحق باستخدام التطبيق طوال مدة الاشتراك، شريطة التقيد بالآتي:&bull; عدم القيام وعدم السماح للغير بالقيام بتعديل وترجمة وإنشاء نسخ مشتقة من أو نسخ التطبيق، كليًّا أو جزئيًّا؛ &bull; عدم استعمال و/أو فك و/أو تغيير و/أو التلاعب بأي شكل بالنسخ المصدرية للبرمجيات المتعلقة بالتطبيق(Source code) ؛&bull; بيع و/أو تأجير الغير الحق باستخدام التطبيق؛ &bull; استعمال أي حق من حقوق الملكية الفكرية المرتبطة بالتطبيق والتي تعود إلى الشركة المالكة لأغراض شخصية.</li>
                    <li style={{ textAlign: 'right' }}>                 تحتفظ الشركة المالكة بالحق في تعليق أو وقف وصولك إلى الخدمة (بشكل مؤقت أو دائم) في أي وقت دون سابق إنذار في حال مخالفتك لأي من أحكام هذه الشروط.</li>
                    <li style={{ textAlign: 'right' }}>                 تلتزم الشركة المالكة ببذل قصارى جهدها لتكون الخدمة متاحة لك في كل الأوقات، دون أن يعني ذلك ضمان عدم وجود أي انقطاعات أو أي أخطاء تؤثر في الخدمة لأسباب خارجة عن إرادة أو سيطرة الشركة المالكة.</li>
                    <li style={{ textAlign: 'right' }}>                 تحتفظ الشركة المالكة بحقها في إجراء تغييرات على الخدمة أو جزء منها من وقت إى آخر بما تراه مناسبًا.</li>
                    <li style={{ textAlign: 'right' }}>                 يجب عليك الاحتفاظ والاهتمام بكافة التفاصيل الخاصة بك مثل اسم أو رمز تسجيل الدخول وكلمة السر بشكل آمن وسري.</li>
                    <li style={{ textAlign: 'right' }}>                 الشركة المالكة غير مسؤولة عن أي خسارة أو ضرر ناجم عن فيروس أو غيرها من الأمور الضارة من الناحية التكنولوجية التي قد تصيب أي جهاز عائد إليك نتيجة استخدام التطبيق.</li>
                    <li style={{ textAlign: 'right' }}>               الشركة المالكة ملتزمة بحماية خصوصيتك وسرية أية معلوماتك الشخصية وفقًا لأحكام التشريعات النافذة.</li>
                    <li style={{ textAlign: 'right' }}>                تخضع هذه الشروط وتفسر وفقًا لتشريعات المملكة الأردنية الهاشمية.</li>
                </ol>

            </div>

        </div>
    )
}
Terms.layout = "In";

export default Terms;